{"Server": ["a server is a computer program or device that provides functionality for other programs or devices, called clients by providing an array of functionalities that include sharing data or resources among multiple clients, or performing computation for a client."], "Web Application": ["A computer program that is run inside a browser. These are usually hosted by Web Application servers.Slightly different from a Web Server, which hosts web pages.The world wide web is made possible due to the use of web servers."], "Lan": ["Local Area Network (LAN) is a group of computers and peripheral devices that share a common communication line or wireless link to a server within a distinct geographic area. Ethernet and Wifi are the two primary ways to set up a  LAN."],"Deepfake": ["A human image synthesis that uses A.I to combine and superimpose existing images and videos unto source images or videos using a Machine Learning technique called Generative Adversial Network"], "Deep Learning": ["Deep Learning is a part of a broader family of machine learning methods based on artificial neural networks. Learning can be supervised, semi-supervised or unsupervised."],"Indexer":["An indexer allows an instance of a class or struct to be indexed as an array. If the user will define an indexer for a class, then the class will behave like a virtual array. Array access operator i.e ([ ]) is used to access the instance of the class which uses an indexer. A user can retrieve or set the indexed value without pointing an instance or a type member. Indexers are almost similar to the Properties. The main difference between Indexers and Properties is that the accessors of the Indexers will take parameters."], "Crawler": ["A crawler is a program that visits Web sites and reads their pages and other information in order to create entries for a search engine index. The major search engines on the Web all have such a program, which is also known as a spider or a bot."], "Web Indexing": ["Web indexing refers to various methods for indexing the contents of a website or of the Internet as a whole. Individual websites or intranets may use a back-of-the-book index, while search engines usually use keywords and metadata to provide a more useful vocabulary for Internet or onsite searching. "], "Indexing": ["Indexing is a way to optimize the performance of a database by minimizing the number of disk accesses required when a query is processed. It is a data structure technique which is used to quickly locate and access the data in a database."], "Graphics Processing Unit": ["A graphics processing unit (GPU) is a specialized electronic circuit designed to rapidly manipulate and alter memory to accelerate the creation of images in a frame buffer intended for output to a display device. GPUs are used in embedded systems, mobile phones, personal computers, workstations, and game consoles."],"Bitmap": ["In computing, a bitmap is a mapping from some domain to bits. It is also called a bit array or bitmap index. The more general term pix-map refers to a map of pixels, where each one may store more than two colors, thus using more than one bit per pixel."]}